txt_str = list(input('Введите строку: '))
txt_set = set()

for i in txt_str:
    if i in txt_set:
        txt_set.remove(i)
    else:
        txt_set.add(i)

if len(txt_set) > 1:
    print('Нельзя сделать палиндромом')
else:
    print('Можно сделать палиндромом')

# ('можно','нельзя') - кортеж из двух элементов-слов.
# len(a)>1 - логическое выражение, которое приводится к 1, если истина и к 0, если ложь.
# То-есть выбирается нужный вариант.('можно','нельзя')[0] - можно, ('можно','нельзя')[1] - нельзя

print(('Можно', 'Нельзя')[len(txt_set) > 1], 'сделать палиндромом')
