import random

nums_1 = [29, 17, 10, 15, 13, 22, 12, 22, 7, 24, 26, 3, 11, 2, 3, 16, 19, 21, 2, 3, 8, 27, 2, 17, 2, 20, 12, 21, 3, 1]
nums_2 = [16, 21, 30, 24, 5, 7, 23, 13, 11, 5, 21, 5, 19, 9, 12, 9, 15, 16, 29, 8, 16, 1, 22, 15, 16, 9, 1, 13, 21, 21]

print(f'1-е множество: {set(nums_1)}')
print(f'2-е множество: {set(nums_2)}')

print(f'Минимальный элемент 1-го множества: {min(set(nums_1))}')
print(f'Минимальный элемент 2-го множества: {min(set(nums_2))}')

x = random.randint(100, 200)
y = random.randint(100, 200)

print(f'Случайное число для 1-го множества: {x}')
print(f'Случайное число для 2-го множества: {y}')

arr_1 = set(nums_1)
arr_2 = set(nums_2)
arr_1.add(x)
arr_2.add(y)

print(f'Объединение множеств:{arr_1.union(arr_2)}')
print(f'Пересечение множеств:{arr_1.intersection(arr_2)}')

print(f'Элементы, входящие в nums_2, но не входящие в nums_1:{arr_2-arr_1}')